Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/health_system/registration_of_health_and_social_care_professionals.html.txt.tmx
Source language: en
Languages: ga

source: Registration of health and social care professionals
ga: Clárú gairmithe sláinte agus cúraim shóisialaigh

source: CORU is the regulator for health and social care professionals
ga: Is é CORU an rialálaí le haghaidh gairmithe sláinte agus cúraim shóisialaigh

source: Its role is to protect the public by promoting high standards of professional conduct, education, training and competence through statutory registration of health and social care professionals
ga: Is é an ról atá aige ná an pobal a chosaint trí chaighdeáin arda iompair ghairmiúil, oideachais, oiliúna agus inniúlachta a chur chun cinn trí bhíthin chlárú reachtúil na ngairmithe sláinte agus cúraim shóisialaigh

source: It was set up under the Health and Social Care Professionals Act 2005, (as amended)
ga: Bunaíodh é faoin Acht um Ghairmithe Sláinte agus Cúraim Shóisialaigh 2005 (pdf) (arna leasú)

source: The system of statutory registration will apply to the following 12 health and social care professions, regardless of whether they work in the public or private sector or are self-employed:
ga: Bainfidh an córas um chlárú reachtúil faoi láthair leis an 12 ghairm sláinte agus cúraim shóisialaigh seo a leanas, beag beann ar cibé acu a oibríonn siad san earnáil phoiblí nó san earnáil phríobháideach nó atá siad féinfhostaithe;

source: The registers for dietitians, occupational therapists, optometrists/dispensing opticians, physiotherapists, radiographers/radiation therapists, social workers, and speech and language therapists are open
ga: Tá na cláir d’oibrithe sóisialta, teiripeoirí ceirde, optaiméadraithe/radharceolaithe dáilte, fisiteiripeoirí, radagrafaithe/teiripeoirí radaíochta, diaitéitigh, agus teiripeoirí urlabhra agus teanga ar oscailt

source: Once a register opens, there is a two-year transitional period after which only professionals on the Register are legally allowed to use the professional title
ga: Bíonn idirthréimhse dhá bhliain ann ach a n-osclaítear clár, nach gceadaítear ach amháin do ghairmithe ar an gClár chun leas a bhaint as an teideal gairmiúil

source: Complaints – Fitness to Practise
ga: Gearáin - Oiriúnacht chun Cleachtadh

source: CORU handles complaints about the fitness to practice of registered health and social care professionals
ga: Láimhseálann CORU gearáin faoi oiriúnacht chun cleachtaidh gairmithe cláraithe sláinte agus cúraim shóisialta

source: This may include, for example, complaints of professional misconduct or poor professional performance
ga: D’fhéadfaí a áireamh leis seo, mar shampla, gearáin faoi mhí-iompar gairmiúil nó drochfheidhmíocht ghairmiúil

source: CORU can only look into events that have occurred since 31 December 2014, when it started accepting complaints
ga: Ní féidir le CORU ach imeachtaí a fhiosrú a tharla ón 31 Nollaig 2014, nuair a thosaigh siad ag glacadh le gearáin

source: To make a complaint about a registered practitioner, complete CORU’s Fitness to Practise complaint form
ga: Chun gearán a dhéanamh faoi chleachtóir cláraithe, comhlánaigh foirm ghearáin um Oiriúnacht chun Cleachtaidh CORU

source: Further information on the Fitness to Practise complaints process is available on the CORU website and there is a CORU Guide to Fitness to Practise (pdf)
ga: Tá breis faisnéise ar an bpróiseas gearáin um Oiriúnacht chun Cleachtaidh ar fáil ar láithreán gréasáin CORU agus tá Treoir maidir le hOiriúnacht chun Cleachtaidh (pdf) ann

source: If you wish to make a complaint against a Health and Social Care Professional who is not registered with CORU see healthcomplaints.ie
ga: Más mian leat gearán a dhéanamh i leith Gairmí Sláinte agus Cúraim Shóisialta nach bhfuil cláraithe le CORU, féach healthcomplaints.ie
